In [45]:
import numpy as np
import pandas as pd

s1 = pd.Series(np.arange(4.0,step=1.0),index=['a','b','c','d'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [46]:
display(s1)

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [47]:
s1['a']

0.0

In [48]:
s1[['a','b','d']]

a    0.0
b    1.0
d    3.0
dtype: float64

In [49]:
s1[-2:] *= 2

In [50]:
s1

a    0.0
b    1.0
c    4.0
d    6.0
dtype: float64

In [63]:
np.reshape(np.arange(16),(4,4))#變二維資料
#np.reshape(np.arange(16),(2,8))#變二維資料
#要用二個funthon,不般不會用這個方法

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [64]:
data = np.arange(16).reshape((4,4))
data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [86]:
data = np.arange(16).reshape((4,4))
dataFrame = pd.DataFrame(data,
             index=['台北','台中','台南','高雄'],
             columns = ['one','two','three','four'])
dataFrame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [84]:
dataFrame['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [72]:
dataFrame[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [87]:
display(dataFrame)
dataFrame.loc['台北']

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

one      0
two      1
three    2
four     3
Name: 台北, dtype: int64

In [78]:
dataFrame.loc[['台北','台中']]#loc以列為主

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [81]:
dataFrame.iloc[[0,1]]#先選列,再選欄,iloc只能索引

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [80]:
dataFrame.loc[['台北','台中']][['one','two']]

    one  two
台北    0    1
台中    4    5

In [82]:
dataFrame.iloc[[0,1]][['one','two']]

    one  two
台北    0    1
台中    4    5

In [83]:
dataFrame.iloc[[0,1],[0,1]] #iloc只能索引

    one  two
台北    0    1
台中    4    5